app/controllers/comments_controller.rb

  def index
    redirect_to controller: 'users', action: 'show',id: current_user.id  if user_signed_in?
    @comments = Comment.order("id DESC").page(params[:page]).per(10)
---
SELECT  `comments`.* FROM `comments` ORDER BY id DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `comments`

  def new
    @user = User.find(current_user.id)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def create
    @comment = Comment.create(comment: params_comment,user_id: current_user.id)
---
INSERT INTO `comments` (`comment`, `created_at`, `updated_at`, `user_id`) VALUES ('{\"comment\"=>\"eqxxxfw\"}', '2019-07-10 08:42:43', '2019-07-10 08:42:43', 1)

  def edit
    @user = User.find(current_user.id)
    @comment = Comment.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = 6 LIMIT 1

  def destroy
    @comment = Comment.find(params[:id]).delete
---
DELETE FROM `comments` WHERE `comments`.`id` = 4
SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = 14 LIMIT 1

  def update
    @comment = Comment.find(params[:id]).update(comment: params_comment)
---
SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = 13 LIMIT 1
UPDATE `comments` SET `comment` = 'aaaaaaaaaaaaa', `updated_at` = '2019-07-10 12:31:04' WHERE `comments`.`id` = 9