app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
SELECT  `comments`.* FROM `comments` WHERE `comments`.`user_id` = 1 LIMIT 10 OFFSET 0
SELECT  `users`.* FROM `users` LIMIT 11
SELECT COUNT(*) FROM `comments` WHERE `comments`.`user_id` = 1
---
  def show
    user = User.order("id DESC").find(current_user[:id])
    @comments = user.comments.all.page(params[:page]).per(10)